/* M10D Git upload-pack fixture: return one chunk by number. */
parse arg n
if datatype(n,'W')\=1 | n<1 then exit 4
if n=1 then do
 say '303030384E414B0A3030323302456E756D65726174696E67206F626A6563'
 exit 0
end
if n=2 then do
 say '74733A20332C20646F6E652E0A3030336602436F756E74696E67206F626A'
 exit 0
end
if n=3 then do
 say '656374733A20203333252028312F33290D436F756E74696E67206F626A65'
 exit 0
end
if n=4 then do
 say '6374733A20203636252028322F33290D3030343602436F756E74696E6720'
 exit 0
end
if n=5 then do
 say '6F626A656374733A20313030252028332F33290D436F756E74696E67206F'
 exit 0
end
if n=6 then do
 say '626A656374733A20313030252028332F33292C20646F6E652E0A30306363'
 exit 0
end
if n=7 then do
 say '015041434B00000002000000039409789C8D8B410AC2301045F739C5EC05'
 exit 0
end
if n=8 then do
 say '99B693A4828887E805D2992F0AC6483B82C73747F02DDEE2C1F30DA02CB9'
 exit 0
end
if n=9 then do
 say 'AC3A698AC34DD96C18CB9411D7A892C1C6A31A9B0A42F9F8BD6DB460773A'
 exit 0
end
if n=10 then do
 say '7BF715DF52DF4F1CB5D50B9D24A55966663A7027F4581FEEF8FF08ED85F0'
 exit 0
end
if n=11 then do
 say '03627B2CBCA102789C3334303033315148D42BA92861F8B4ABBF65758CF4'
 exit 0
end
if n=12 then do
 say 'B996E55B1C4F4B469E3FCE695D0F00CD100DA433789C4B4C4A0600024D01'
 exit 0
end
if n=13 then do
 say '2700C20177E759DC5FFD06EA42D0A1D1E1A9F53E30303036017B30303433'
 exit 0
end
if n=14 then do
 say '02546F74616C2033202864656C74612030292C2072657573656420302028'
 exit 0
end
if n=15 then do
 say '64656C74612030292C207061636B2D7265757365642030202866726F6D20'
 exit 0
end
if n=16 then do
 say '30290A30303030'
 exit 0
end
exit 1
