GITCORE  CSECT
         USING GITCORE,12
         LR    12,15
         LR    11,0
         USING EPLIST,11
         L     2,EPLARGBG
         L     3,EPLARGND
         SR    3,2
         C     3,=F'7'
         BNE   BADARG
         CLC   0(7,2),=C'SHA1ABC'
         BE    SHA1ABC
         CLC   0(7,2),=C'SHA1EMP'
         BE    SHA1EMP
         CLC   0(7,2),=C'VERSION'
         BNE   BADARG
         LINEWRT DATA=(VERSION,VERLEN)
         SR    15,15
         BR    14
*
* M1B: run SHA-1 engine against two independent standard test vectors.
* SHA1BLK leaves computed state in HASH0-HASH4 for caller verification.
*
SHA1ABC  ST    14,CALLRET
         LA    2,ABCBLOCK
         BAL   14,SHA1BLK
         C     4,ABCEXP0
         BNE   SHA1BAD
         C     5,ABCEXP1
         BNE   SHA1BAD
         C     6,ABCEXP2
         BNE   SHA1BAD
         C     7,ABCEXP3
         BNE   SHA1BAD
         C     8,ABCEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(ABCDIG,ABCDLEN)
         B     SHA1OK
SHA1EMP  ST    14,CALLRET
         LA    2,EMPBLOCK
         BAL   14,SHA1BLK
         C     4,EMPEXP0
         BNE   SHA1BAD
         C     5,EMPEXP1
         BNE   SHA1BAD
         C     6,EMPEXP2
         BNE   SHA1BAD
         C     7,EMPEXP3
         BNE   SHA1BAD
         C     8,EMPEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(EMPDIG,EMPDLEN)
SHA1OK   SR    15,15
         L     14,CALLRET
         BR    14
SHA1BAD  LINEWRT DATA=(FAILMSG,FAILLEN)
         LA    15,4
         L     14,CALLRET
         BR    14
BADARG   LINEWRT DATA=(USAGE,USAGELEN)
         LA    15,4
         BR    14
*
* SHA1BLK - SHA-1 compression of one already-padded 64-byte block.
* R2 -> block.  Returns final state in R4-R8 and HASH0-HASH4.
*
SHA1BLK  STM   3,14,SAVEREGS
         LA    3,WARRAY
         LA    4,16
         LR    5,2
LOADW    L     6,0(5)
         ST    6,0(3)
         LA    5,4(5)
         LA    3,4(3)
         BCT   4,LOADW
         LA    4,64
         LA    3,WARRAY+64
EXPAND   LR    5,3
         S     5,=F'12'
         L     6,0(5)
         LR    5,3
         S     5,=F'32'
         X     6,0(5)
         LR    5,3
         S     5,=F'56'
         X     6,0(5)
         LR    5,3
         S     5,=F'64'
         X     6,0(5)
         LR    7,6
         SLL   6,1
         SRL   7,31
         OR    6,7
         ST    6,0(3)
         LA    3,4(3)
         BCT   4,EXPAND
*
         L     4,H0INIT
         L     5,H1INIT
         L     6,H2INIT
         L     7,H3INIT
         L     8,H4INIT
         LA    9,WARRAY
         SR    10,10
ROUND    LR    3,5
         C     10,=F'20'
         BL    R0
         C     10,=F'40'
         BL    R20
         C     10,=F'60'
         BL    R40
R60      XR    3,6
         XR    3,7
         L     11,K3
         B     FCALC
R40      NR    3,6
         LR    11,5
         OR    11,6
         NR    11,7
         OR    3,11
         L     11,K2
         B     FCALC
R20      XR    3,6
         XR    3,7
         L     11,K1
         B     FCALC
R0       NR    3,6
         LR    11,5
         X     11,=X'FFFFFFFF'
         NR    11,7
         OR    3,11
         L     11,K0
FCALC    LR    14,4
         SLL   14,5
         LR    2,4
         SRL   2,27
         OR    14,2
         AR    14,3
         AR    14,8
         AR    14,11
         A     14,0(9)
         LR    8,7
         LR    7,6
         LR    3,5
         SRL   3,2
         LR    2,5
         SLL   2,30
         OR    3,2
         LR    6,3
         LR    5,4
         LR    4,14
         LA    9,4(9)
         LA    10,1(10)
         C     10,=F'80'
         BL    ROUND
         A     4,H0INIT
         A     5,H1INIT
         A     6,H2INIT
         A     7,H3INIT
         A     8,H4INIT
         ST    4,HASH0
         ST    5,HASH1
         ST    6,HASH2
         ST    7,HASH3
         ST    8,HASH4
* Restore R9-R14; R4-R8 deliberately return the state.
         LM    9,14,SAVEREGS+24
         SR    15,15
         BR    14
*
VERSION  DC    C'GITCORE 0.3 CMS/ZVM'
VERLEN   EQU   *-VERSION
USAGE    DC    C'Usage: GITCORE VERSION, SHA1ABC, or SHA1EMP'
USAGELEN EQU   *-USAGE
ABCDIG   DC    C'A9993E364706816ABA3E25717850C26C9CD0D89D'
ABCDLEN  EQU   *-ABCDIG
EMPDIG   DC    C'DA39A3EE5E6B4B0D3255BFEF95601890AFD80709'
EMPDLEN  EQU   *-EMPDIG
FAILMSG  DC    C'SHA1 SELF-TEST FAILED'
FAILLEN  EQU   *-FAILMSG
         DS    0F
H0INIT   DC    X'67452301'
H1INIT   DC    X'EFCDAB89'
H2INIT   DC    X'98BADCFE'
H3INIT   DC    X'10325476'
H4INIT   DC    X'C3D2E1F0'
K0       DC    X'5A827999'
K1       DC    X'6ED9EBA1'
K2       DC    X'8F1BBCDC'
K3       DC    X'CA62C1D6'
ABCEXP0  DC    X'A9993E36'
ABCEXP1  DC    X'4706816A'
ABCEXP2  DC    X'BA3E2571'
ABCEXP3  DC    X'7850C26C'
ABCEXP4  DC    X'9CD0D89D'
EMPEXP0  DC    X'DA39A3EE'
EMPEXP1  DC    X'5E6B4B0D'
EMPEXP2  DC    X'3255BFEF'
EMPEXP3  DC    X'95601890'
EMPEXP4  DC    X'AFD80709'
         DS    0F
ABCBLOCK DC    X'61626380000000000000000000000000'
         DC    X'00000000000000000000000000000000'
         DC    X'00000000000000000000000000000000'
         DC    X'00000000000000000000000000000018'
EMPBLOCK DC    X'80000000000000000000000000000000'
         DC    X'00000000000000000000000000000000'
         DC    X'00000000000000000000000000000000'
         DC    X'00000000000000000000000000000000'
CALLRET  DS    F
HASH0    DS    F
HASH1    DS    F
HASH2    DS    F
HASH3    DS    F
HASH4    DS    F
SAVEREGS DS    12F
WARRAY   DS    80F
         EPLIST
         END   GITCORE
