GITCORE  CSECT
         USING GITCORE,12
         LR    12,15
         LR    11,0
         USING EPLIST,11
         L     2,EPLARGBG
         L     3,EPLARGND
         SR    3,2
         C     3,=F'7'
         BNE   BADARG
         CLC   0(7,2),=C'SHA1ABC'
         BE    SHA1ABC
         CLC   0(7,2),=C'SHA1EMP'
         BE    SHA1EMP
         CLC   0(7,2),=C'SHA1TWO'
         BE    SHA1TWO
         CLC   0(7,2),=C'SHA1MUL'
         BE    SHA1MUL
         CLC   0(7,2),=C'VERSION'
         BNE   BADARG
         LINEWRT DATA=(VERSION,VERLEN)
         SR    15,15
         BR    14
*
* M1C: SHA1GEN accepts binary bytes and a byte count.
* It pads internally. Tests include empty, abc, 56, and 80 bytes.
*
SHA1ABC  ST    14,CALLRET
         LA    2,ABCDATA
         LA    3,3
         BAL   14,SHA1GEN
         C     4,ABCEXP0
         BNE   SHA1BAD
         C     5,ABCEXP1
         BNE   SHA1BAD
         C     6,ABCEXP2
         BNE   SHA1BAD
         C     7,ABCEXP3
         BNE   SHA1BAD
         C     8,ABCEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(ABCDIG,ABCDLEN)
         B     SHA1OK
SHA1EMP  ST    14,CALLRET
         LA    2,ABCDATA
         SR    3,3
         BAL   14,SHA1GEN
         C     4,EMPEXP0
         BNE   SHA1BAD
         C     5,EMPEXP1
         BNE   SHA1BAD
         C     6,EMPEXP2
         BNE   SHA1BAD
         C     7,EMPEXP3
         BNE   SHA1BAD
         C     8,EMPEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(EMPDIG,EMPDLEN)
         B     SHA1OK
SHA1TWO  ST    14,CALLRET
         LA    2,TWODATA
         LA    3,56
         BAL   14,SHA1GEN
         C     4,TWOEXP0
         BNE   SHA1BAD
         C     5,TWOEXP1
         BNE   SHA1BAD
         C     6,TWOEXP2
         BNE   SHA1BAD
         C     7,TWOEXP3
         BNE   SHA1BAD
         C     8,TWOEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(TWODIG,TWODLEN)
         B     SHA1OK
SHA1MUL  ST    14,CALLRET
         LA    2,MULDATA
         LA    3,80
         BAL   14,SHA1GEN
         C     4,MULEXP0
         BNE   SHA1BAD
         C     5,MULEXP1
         BNE   SHA1BAD
         C     6,MULEXP2
         BNE   SHA1BAD
         C     7,MULEXP3
         BNE   SHA1BAD
         C     8,MULEXP4
         BNE   SHA1BAD
         LINEWRT DATA=(MULDIG,MULDLEN)
SHA1OK   SR    15,15
         L     14,CALLRET
         BR    14
SHA1BAD  LINEWRT DATA=(FAILMSG,FAILLEN)
         LA    15,4
         L     14,CALLRET
         BR    14
BADARG   LINEWRT DATA=(USAGE,USAGELEN)
         LA    15,4
         BR    14
*
* SHA1GEN - binary-safe SHA-1 driver.
* R2 -> input bytes, R3 = unsigned byte length (up to 2^32-1).
* Initializes state, consumes full blocks, and creates SHA-1 padding.
* Returns digest state in R4-R8 and HASH0-HASH4.
*
SHA1GEN  ST    14,GENRET
         ST    2,GENPTR
         ST    3,GENLEN
         LR    4,3
         SRL   4,29
         ST    4,GENHI
         LR    4,3
         SLL   4,3
         ST    4,GENLO
         MVC   HASH0(20),H0INIT
GENFULL  L     3,GENLEN
         C     3,=F'64'
         BL    GENTAIL
         L     2,GENPTR
         BAL   14,SHA1BLK
         L     2,GENPTR
         LA    2,64(2)
         ST    2,GENPTR
         L     3,GENLEN
         S     3,=F'64'
         ST    3,GENLEN
         B     GENFULL
GENTAIL  XC    PADBLOCK(64),PADBLOCK
         LA    4,PADBLOCK
         L     2,GENPTR
         L     3,GENLEN
         ST    3,GENREM
         LTR   3,3
         BZ    GENMARK
GENCOPY  IC    5,0(2)
         STC   5,0(4)
         LA    2,1(2)
         LA    4,1(4)
         BCT   3,GENCOPY
GENMARK  MVI   0(4),X'80'
         L     3,GENREM
         C     3,=F'56'
         BL    GENLAST
         LA    2,PADBLOCK
         BAL   14,SHA1BLK
         XC    PADBLOCK(64),PADBLOCK
GENLAST  L     4,GENHI
         ST    4,PADBLOCK+56
         L     4,GENLO
         ST    4,PADBLOCK+60
         LA    2,PADBLOCK
         BAL   14,SHA1BLK
         L     14,GENRET
         SR    15,15
         BR    14
*
* SHA1BLK - SHA-1 compression of one 64-byte block.
* R2 -> block. HASH0-HASH4 hold input and output chaining state.
* Returns the new state in R4-R8 and HASH0-HASH4.
*
SHA1BLK  STM   3,14,SAVEREGS
         LA    3,WARRAY
         LA    4,16
         LR    5,2
LOADW    L     6,0(5)
         ST    6,0(3)
         LA    5,4(5)
         LA    3,4(3)
         BCT   4,LOADW
         LA    4,64
         LA    3,WARRAY+64
EXPAND   LR    5,3
         S     5,=F'12'
         L     6,0(5)
         LR    5,3
         S     5,=F'32'
         X     6,0(5)
         LR    5,3
         S     5,=F'56'
         X     6,0(5)
         LR    5,3
         S     5,=F'64'
         X     6,0(5)
         LR    7,6
         SLL   6,1
         SRL   7,31
         OR    6,7
         ST    6,0(3)
         LA    3,4(3)
         BCT   4,EXPAND
*
         L     4,HASH0
         L     5,HASH1
         L     6,HASH2
         L     7,HASH3
         L     8,HASH4
         LA    9,WARRAY
         SR    10,10
ROUND    LR    3,5
         C     10,=F'20'
         BL    R0
         C     10,=F'40'
         BL    R20
         C     10,=F'60'
         BL    R40
R60      XR    3,6
         XR    3,7
         L     11,K3
         B     FCALC
R40      NR    3,6
         LR    11,5
         OR    11,6
         NR    11,7
         OR    3,11
         L     11,K2
         B     FCALC
R20      XR    3,6
         XR    3,7
         L     11,K1
         B     FCALC
R0       NR    3,6
         LR    11,5
         X     11,=X'FFFFFFFF'
         NR    11,7
         OR    3,11
         L     11,K0
FCALC    LR    14,4
         SLL   14,5
         LR    2,4
         SRL   2,27
         OR    14,2
         AR    14,3
         AR    14,8
         AR    14,11
         A     14,0(9)
         LR    8,7
         LR    7,6
         LR    3,5
         SRL   3,2
         LR    2,5
         SLL   2,30
         OR    3,2
         LR    6,3
         LR    5,4
         LR    4,14
         LA    9,4(9)
         LA    10,1(10)
         C     10,=F'80'
         BL    ROUND
         A     4,HASH0
         A     5,HASH1
         A     6,HASH2
         A     7,HASH3
         A     8,HASH4
         ST    4,HASH0
         ST    5,HASH1
         ST    6,HASH2
         ST    7,HASH3
         ST    8,HASH4
* Restore R9-R14; R4-R8 deliberately return the state.
         LM    9,14,SAVEREGS+24
         SR    15,15
         BR    14
*
VERSION  DC    C'GITCORE 0.5 CMS/ZVM'
VERLEN   EQU   *-VERSION
USAGE    DC    C'Usage: VERSION SHA1ABC SHA1EMP SHA1TWO SHA1MUL'
USAGELEN EQU   *-USAGE
ABCDIG   DC    C'A9993E364706816ABA3E25717850C26C9CD0D89D'
ABCDLEN  EQU   *-ABCDIG
EMPDIG   DC    C'DA39A3EE5E6B4B0D3255BFEF95601890AFD80709'
EMPDLEN  EQU   *-EMPDIG
TWODIG   DC    C'84983E441C3BD26EBAAE4AA1F95129E5E54670F1'
TWODLEN  EQU   *-TWODIG
MULDIG   DC    C'86F33652FCFFD7FA1443E246DD34FE5D00E25FFD'
MULDLEN  EQU   *-MULDIG
FAILMSG  DC    C'SHA1 SELF-TEST FAILED'
FAILLEN  EQU   *-FAILMSG
         DS    0F
H0INIT   DC    X'67452301'
H1INIT   DC    X'EFCDAB89'
H2INIT   DC    X'98BADCFE'
H3INIT   DC    X'10325476'
H4INIT   DC    X'C3D2E1F0'
K0       DC    X'5A827999'
K1       DC    X'6ED9EBA1'
K2       DC    X'8F1BBCDC'
K3       DC    X'CA62C1D6'
ABCEXP0  DC    X'A9993E36'
ABCEXP1  DC    X'4706816A'
ABCEXP2  DC    X'BA3E2571'
ABCEXP3  DC    X'7850C26C'
ABCEXP4  DC    X'9CD0D89D'
EMPEXP0  DC    X'DA39A3EE'
EMPEXP1  DC    X'5E6B4B0D'
EMPEXP2  DC    X'3255BFEF'
EMPEXP3  DC    X'95601890'
EMPEXP4  DC    X'AFD80709'
TWOEXP0  DC    X'84983E44'
TWOEXP1  DC    X'1C3BD26E'
TWOEXP2  DC    X'BAAE4AA1'
TWOEXP3  DC    X'F95129E5'
TWOEXP4  DC    X'E54670F1'
MULEXP0  DC    X'86F33652'
MULEXP1  DC    X'FCFFD7FA'
MULEXP2  DC    X'1443E246'
MULEXP3  DC    X'DD34FE5D'
MULEXP4  DC    X'00E25FFD'
         DS    0F
ABCDATA  DC    X'616263'
TWODATA  DC    X'61626364626364656364656664656667'
         DC    X'65666768666768696768696A68696A6B'
         DC    X'696A6B6C6A6B6C6D6B6C6D6E6C6D6E6F'
         DC    X'6D6E6F706E6F7071'
MULDATA  DC    80X'61'
CALLRET  DS    F
GENRET   DS    F
GENPTR   DS    F
GENLEN   DS    F
GENREM   DS    F
GENHI    DS    F
GENLO    DS    F
HASH0    DS    F
HASH1    DS    F
HASH2    DS    F
HASH3    DS    F
HASH4    DS    F
PADBLOCK DS    64C
SAVEREGS DS    12F
WARRAY   DS    80F
         EPLIST
         END   GITCORE
