GITINFA  CSECT
         USING GITINFA,12
         LR    12,15
         ST    14,RETADDR
         LR    11,0
         USING EPLIST,11
*
* M13N stage 1: prove native CMS MODULE calling convention and
* bounded 32 KiB history work area before moving DEFLATE hot loops.
*
         L     2,EPLARGBG
         L     3,EPLARGND
         SR    3,2
         C     3,=F'4'
         BL    BADARG
         CLC   0(4,2),=C'SELF'
         BNE   BADARG
         MVC   HIST(256),PATTERN
         CLC   HIST(256),PATTERN
         BNE   BADHIST
         LA    4,HIST
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,4095(4)
         LA    4,1(4)
         LA    4,3840(4)
         MVC   0(256,4),PATTERN
         CLC   0(256,4),PATTERN
         BNE   BADHIST
         LINEWRT DATA=(OKMSG,OKLEN)
         SR    15,15
         B     RETURN
BADARG   LINEWRT DATA=(USAGE,USAGELEN)
         LA    15,4
         B     RETURN
BADHIST  LINEWRT DATA=(HMSG,HMSGLEN)
         LA    15,8
RETURN   L     14,RETADDR
         BR    14
         LTORG
OKMSG    DC    C'GITINFA: NATIVE 32K WINDOW SELFTEST PASSED'
OKLEN    EQU   *-OKMSG
USAGE    DC    C'Usage: GITINFA SELF'
USAGELEN EQU   *-USAGE
HMSG     DC    C'GITINFA: 32K WINDOW SELFTEST FAILED'
HMSGLEN  EQU   *-HMSG
RETADDR  DS    F
PATTERN  DC    32CL8'GITINFL!'
         DS    0D
HIST     DS    32768C
         END   GITINFA
