GITNCALL CSECT
         EXTRN GITNAPI
         USING GITNCALL,12
         LR    12,15
         ST    14,RETCALL
         LA    13,SAVE
         MVI   ERRSTG,C'1'
         LA    1,PARAM
         L     15,=V(GITNAPI)
         BALR  14,15
         MVI   ERRCHK,C'R'
         LTR   15,15
         BNZ   FAILED
         MVI   ERRCHK,C'O'
         CLC   PARAM+16(4),=F'3'
         BNE   FAILED
         MVI   ERRCHK,C'C'
         CLC   PARAM+20(4),=F'11'
         BNE   FAILED
         MVI   ERRCHK,C'D'
         CLC   OUTPUT(3),ABC
         BNE   FAILED
*
* Repeat with a trailing PACK stream and reuse same buffer.
*
         LA    2,TRAIL
         ST    2,PARAM
         LA    2,14
         ST    2,PARAM+4
         MVI   ERRSTG,C'2'
         LA    1,PARAM
         L     15,=V(GITNAPI)
         BALR  14,15
         LTR   15,15
         BNZ   FAILED
         CLC   PARAM+16(4),=F'3'
         BNE   FAILED
         CLC   PARAM+20(4),=F'11'
         BNE   FAILED
         CLC   OUTPUT(3),ABC
         BNE   FAILED
*
* Capacity failure must leave both output counts zero.
*
         LA    2,2
         ST    2,PARAM+12
         MVI   ERRSTG,C'3'
         LA    1,PARAM
         L     15,=V(GITNAPI)
         BALR  14,15
         LTR   15,15
         BZ    FAILED
         CLC   PARAM+16(8),ZERO8
         BNE   FAILED
*
* Bad Adler checksum must reject and clear result counts.
*
         LA    2,16
         ST    2,PARAM+12
         LA    2,BADSUM
         ST    2,PARAM
         LA    2,11
         ST    2,PARAM+4
         MVI   ERRSTG,C'4'
         LA    1,PARAM
         L     15,=V(GITNAPI)
         BALR  14,15
         LTR   15,15
         BZ    FAILED
         CLC   PARAM+16(8),ZERO8
         BNE   FAILED
*
* Recover after error with second member of adjacent zlib pair.
*
         LA    2,PAIR+11
         ST    2,PARAM
         MVI   ERRSTG,C'5'
         LA    1,PARAM
         L     15,=V(GITNAPI)
         BALR  14,15
         LTR   15,15
         BNZ   FAILED
         CLC   PARAM+16(4),=F'3'
         BNE   FAILED
         CLC   PARAM+20(4),=F'11'
         BNE   FAILED
         CLC   OUTPUT(3),ABC
         BNE   FAILED
         LINEWRT DATA=(OKMSG,OKLEN)
         SR    15,15
         B     EXIT
FAILED   ST    15,ERRRC
         LINEWRT DATA=(ERRMSG,ERRLEN)
         LA    15,8
EXIT     L     14,RETCALL
         BR    14
         LTORG
         DS    0F
RETCALL  DS    F
SAVE     DS    18F
PARAM    DC    A(STREAM),F'11',A(OUTPUT),F'16'
         DC    F'0',F'0'
STREAM   DC    X'789C4B4C4A0600024D0127'
TRAIL    DC    X'789C4B4C4A0600024D0127AABBCC'
BADSUM   DC    X'789C4B4C4A0600024D0126'
PAIR     DC    X'789C4B4C4A0600024D0127'
         DC    X'789C4B4C4A0600024D0127'
ABC      DC    C'abc'
OUTPUT   DS    16C
ZERO8    DC    8X'00'
OKMSG    DC    C'GITNCALL: EXTERNAL NATIVE API PASSED'
OKLEN    EQU   *-OKMSG
ERRMSG   DC    C'GITNCALL: EXTERNAL NATIVE API FAILED STAGE '
ERRSTG   DC    C'? CHECK '
ERRCHK   DC    C'?'
ERRLEN   EQU   *-ERRMSG
ERRRC    DS    F
         END   GITNCALL
