GITRD    CSECT
         USING GITRD,12
         LR    12,15
         ST    14,RETADDR
*
* Focused M3E diagnostic for CMS LINERD TYPE=STACK.
* The caller queues exactly two known records used by M3ETEST.
*
         LINERD DATA=(INBUF,128),TYPE=STACK,CASE=MIXED,TRANS=NO,       X
               PAD=BLANK,ERROR=RD1ERR
         C     0,=F'8'
         BNE   RD1LEN
         CLC   INBUF(8),=C'0000000A'
         BNE   RD1DATA
         LINEWRT DATA=(OK1MSG,OK1LEN)
*
         LINERD DATA=(INBUF,128),TYPE=STACK,CASE=MIXED,TRANS=NO,       X
               PAD=BLANK,ERROR=RD2ERR
         C     0,=F'20'
         BNE   RD2LEN
         CLC   INBUF(20),=C'626C6F62203300616263'
         BNE   RD2DATA
         LINEWRT DATA=(OK2MSG,OK2LEN)
         SR    15,15
         L     14,RETADDR
         BR    14
*
RD1ERR   LINEWRT DATA=(E1MSG,E1LEN)
         B     BADRET
RD1LEN   LINEWRT DATA=(L1MSG,L1LEN)
         B     BADRET
RD1DATA  LINEWRT DATA=(D1MSG,D1LEN)
         B     BADRET
RD2ERR   LINEWRT DATA=(E2MSG,E2LEN)
         B     BADRET
RD2LEN   LINEWRT DATA=(L2MSG,L2LEN)
         B     BADRET
RD2DATA  LINEWRT DATA=(D2MSG,D2LEN)
BADRET   LA    15,4
         L     14,RETADDR
         BR    14
         LTORG
*
OK1MSG   DC    C'GITRD: READ1 OK'
OK1LEN   EQU   *-OK1MSG
OK2MSG   DC    C'GITRD: READ2 OK'
OK2LEN   EQU   *-OK2MSG
E1MSG    DC    C'GITRD: READ1 LINERD ERROR'
E1LEN    EQU   *-E1MSG
L1MSG    DC    C'GITRD: READ1 LENGTH WRONG'
L1LEN    EQU   *-L1MSG
D1MSG    DC    C'GITRD: READ1 DATA WRONG'
D1LEN    EQU   *-D1MSG
E2MSG    DC    C'GITRD: READ2 LINERD ERROR'
E2LEN    EQU   *-E2MSG
L2MSG    DC    C'GITRD: READ2 LENGTH WRONG'
L2LEN    EQU   *-L2MSG
D2MSG    DC    C'GITRD: READ2 DATA WRONG'
D2LEN    EQU   *-D2MSG
RETADDR  DS    F
INBUF    DS    128C
         END   GITRD
