M12ATLS  CSECT
         USING M12ATLS,12
         LR    12,15
         ST    14,RETADDR
*
* M12A: z/VM Dynamic SSL TLSQuery capability probe.
* IBM z/VM 6.3 TCP/IP Programmer's Reference:
*   VMCF AUTHORIZE, BEGINtcpIPservice, TLSQuery CALLCODE 128.
* Blank TLS label asks whether the SSL server is available.
*
         HNDEXT SET,VMCFHND,CODE=X'4001',ECB=(VMCFECB,OS),ERROR=HNDERR
         LTR   15,15
         BNZ   HNDERR
*
* Authorize VMCF with a 40-byte external interrupt buffer.
*
         XC    VMCFPL(40),VMCFPL
         LA    2,VMCFBUF
         ST    2,VMCFPL+16
         LA    2,40
         ST    2,VMCFPL+20
         LA    1,VMCFPL
         DIAG  1,2,X'68'
         LTR   2,2
         BNZ   AUTHERR
*
* BEGINtcpIPservice: SEND, CALLCODE 101, TCPIP, client level 6.3.0.
*
         BAL   14,CLEARECB
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0002'
         MVC   VMCFPL+4(4),=F'2'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         MVC   VMCFPL+20(4),=F'1'
         MVC   VMCFPL+32(4),=X'06300000'
         MVI   VMCFPL+38,X'65'
         LA    1,VMCFPL
         DIAG  1,2,X'68'
         LTR   2,2
         BNZ   BEGDIAG
         BAL   14,WAITNEXT
         L     3,INTCOUNT
         C     3,=F'1'
         BL    BEGWAIT
         CLI   SLOT1+39,X'00'
         BNE   BEGRET
*
* TLSQuery: SEND/RECV, CALLCODE 128. Query record is 8 blank
* label bytes plus 50 blank keyring bytes, as documented for VM.
*
         BAL   14,CLEARECB
         MVC   QUERY(58),=CL58' '
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0003'
         MVC   VMCFPL+4(4),=F'4'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         LA    3,QUERY
         ST    3,VMCFPL+16
         LA    3,58
         ST    3,VMCFPL+20
         MVI   VMCFPL+38,X'80'
         LA    1,VMCFPL
         DIAG  1,2,X'68'
         LTR   2,2
         BNZ   QDIAG
         BAL   14,WAIT2
*
* Slot 2 is the preprocessing response.  Slot 3 is the
* QUERYtlsCOMPLETE notification (CALLCODE 33).
*
         CLI   SLOT2+39,X'00'
         BNE   QPRE
         BAL   14,WAIT3
         CLI   SLOT3+38,X'21'
         BNE   QBADNOTE
         BAL   14,REJNOTE
         CLI   SLOT3+39,X'00'
         BNE   QRESULT
         CMSSTACK TEXT=(PASSMSG,PASSLEN)
         B     CLEANOK
*
WAIT2    L     3,INTCOUNT
         C     3,=F'2'
         BNL   W2DONE
         BAL   14,CLEARECB
         L     3,INTCOUNT
         C     3,=F'2'
         BNL   W2DONE
         WAITECB ECB=VMCFECB
W2DONE   BR    14
WAIT3    L     3,INTCOUNT
         C     3,=F'3'
         BNL   W3DONE
         BAL   14,CLEARECB
         L     3,INTCOUNT
         C     3,=F'3'
         BNL   W3DONE
         WAITECB ECB=VMCFECB
W3DONE   BR    14
WAITNEXT EQU   *
         WAITECB ECB=VMCFECB
         BR    14
CLEARECB XC    VMCFECB,VMCFECB
         BR    14
*
* A QUERYtlsCOMPLETE notification is a SEND.  IBM requires
* completion with VMCF REJECT using the interrupt header data.
*
REJNOTE  ST    14,WORKRET
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'000B'
         MVC   VMCFPL+4(4),SLOT3+4
         MVC   VMCFPL+8(8),SLOT3+8
         MVC   VMCFPL+32(8),SLOT3+32
         LA    1,VMCFPL
         DIAG  1,2,X'68'
         L     14,WORKRET
         BR    14
*
* HNDEXT handler.  CP has already placed VMCMHDR in VMCFBUF.
* Preserve the first three interrupts so mainline cannot lose a
* fast QUERYtlsCOMPLETE behind the preprocessing response.
*
VMCFHND  STM   0,15,HNDSAVE
         L     3,INTCOUNT
         LA    3,1(3)
         ST    3,INTCOUNT
         C     3,=F'1'
         BE    HSLOT1
         C     3,=F'2'
         BE    HSLOT2
         C     3,=F'3'
         BE    HSLOT3
         B     HRET
HSLOT1   MVC   SLOT1(40),VMCFBUF
         B     HRET
HSLOT2   MVC   SLOT2(40),VMCFBUF
         B     HRET
HSLOT3   MVC   SLOT3(40),VMCFBUF
HRET     LM    0,14,HNDSAVE
         SR    15,15
         BR    14
*
* Error paths stack compact diagnostics.  Return code is 8.
*
HNDERR   CMSSTACK TEXT=(EHND,L'EHND)
         B     FAIL
AUTHERR  CMSSTACK TEXT=(EAUTH,L'EAUTH)
         B     FAIL
BEGDIAG  CMSSTACK TEXT=(EBEGD,L'EBEGD)
         B     FAIL
BEGWAIT  CMSSTACK TEXT=(EBEGW,L'EBEGW)
         B     FAIL
BEGRET   CMSSTACK TEXT=(EBEGR,L'EBEGR)
         B     FAIL
QDIAG    CMSSTACK TEXT=(EQDIA,L'EQDIA)
         B     FAIL
QPRE     CMSSTACK TEXT=(EQPRE,L'EQPRE)
         B     FAIL
QBADNOTE CMSSTACK TEXT=(EQNOT,L'EQNOT)
         B     FAIL
QRESULT  CMSSTACK TEXT=(EQRES,L'EQRES)
FAIL     LA    15,8
         B     CLEAN
CLEANOK  SR    15,15
CLEAN    ST    15,SAVERC
         HNDEXT CLR,CODE=X'4001'
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0001'
         LA    1,VMCFPL
         DIAG  1,2,X'68'
         L     15,SAVERC
         L     14,RETADDR
         BR    14
*
         DS    0D
VMCFPL   DS    XL40
VMCFBUF  DS    XL40
SLOT1    DS    XL40
SLOT2    DS    XL40
SLOT3    DS    XL40
QUERY    DS    CL58
VMCFECB  DC    F'0'
INTCOUNT DC    F'0'
RETADDR  DS    F
WORKRET  DS    F
SAVERC   DS    F
HNDSAVE  DS    16F
PASSMSG  DC    C'M12A TLSQUERY SSL SERVICE AVAILABLE'
PASSLEN  EQU   *-PASSMSG
EHND     DC    C'M12A ERROR HNDEXT'
EAUTH    DC    C'M12A ERROR VMCF AUTHORIZE'
EBEGD    DC    C'M12A ERROR BEGIN DIAG'
EBEGW    DC    C'M12A ERROR BEGIN RESPONSE MISSING'
EBEGR    DC    C'M12A ERROR BEGIN RETURN'
EQDIA    DC    C'M12A ERROR TLSQUERY DIAG'
EQPRE    DC    C'M12A ERROR TLSQUERY PREPROCESS'
EQNOT    DC    C'M12A ERROR TLSQUERY NOTIFICATION'
EQRES    DC    C'M12A TLSQUERY SSL SERVICE UNAVAILABLE'
         END   M12ATLS
