M12ATLS  CSECT
         USING M12ATLS,12
         LR    12,15
         ST    14,RETADDR
         WRTERM MSTART,L'MSTART
*
* M12A: z/VM Dynamic SSL TLSQuery capability probe.
* IBM z/VM 6.3 TCP/IP Programmer's Reference:
*   VMCF AUTHORIZE, BEGINtcpIPservice, TLSQuery CALLCODE 128.
* Blank TLS label asks whether the SSL server is available.
*
         HNDEXT SET,'DUMMY',CODE=4001,ECB=(VMCFECB,OS),ERROR=HNDERR
         LTR   15,15
         BNZ   HNDERR
*
* Authorize VMCF with a 40-byte external interrupt buffer.
*
         XC    VMCFPL(40),VMCFPL
         LA    2,VMCFBUF
         ST    2,VMCFPL+16
         LA    2,40
         ST    2,VMCFPL+20
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   AUTHERR
         WRTERM MAUTH,L'MAUTH
*
* BEGINtcpIPservice: SEND, CALLCODE 101, TCPIP, client level 6.3.0.
*
         BAL   14,CLEARECB
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0002'
         MVC   VMCFPL+4(4),=F'2'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         MVC   VMCFPL+20(4),=F'1'
         MVC   VMCFPL+32(4),=X'06300000'
         MVI   VMCFPL+38,X'65'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   BEGDIAG
         WRTERM MBEGS,L'MBEGS
         WAITECB ECB=VMCFECB
         MVC   SLOT1(40),VMCFBUF
         WRTERM MBEGR,L'MBEGR
         CLI   SLOT1+39,X'00'
         BNE   BEGRET
*
* TLSQuery: SEND/RECV, CALLCODE 128. Query record is 8 blank
* label bytes plus 50 blank keyring bytes, as documented for VM.
*
         BAL   14,CLEARECB
         MVC   QUERY(58),=CL58' '
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0003'
         MVC   VMCFPL+4(4),=F'4'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         LA    3,QUERY
         ST    3,VMCFPL+16
         LA    3,58
         ST    3,VMCFPL+20
         MVI   VMCFPL+38,X'80'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   QDIAG
         WRTERM MQSENT,L'MQSENT
         WAITECB ECB=VMCFECB
         MVC   SLOT2(40),VMCFBUF
         WRTERM MQPRE,L'MQPRE
*
* Slot 2 is the preprocessing response.  Slot 3 is the
* QUERYtlsCOMPLETE notification (CALLCODE X'19').
*
         CLI   SLOT2+39,X'00'
         BNE   QPRE
         BAL   14,CLEARECB
         WAITECB ECB=VMCFECB
         MVC   SLOT3(40),VMCFBUF
         WRTERM MQDONE,L'MQDONE
         CLI   SLOT3+38,X'19'
         BNE   QBADNOTE
         BAL   14,REJNOTE
         CLI   SLOT3+39,X'00'
         BNE   QRESULT
         CMSSTACK TEXT=(PASSMSG,PASSLEN)
         B     CLEANOK
*
CLEARECB XC    VMCFECB,VMCFECB
         BR    14
*
* A QUERYtlsCOMPLETE notification is a SEND.  IBM requires
* completion with VMCF REJECT using the interrupt header data.
*
REJNOTE  ST    14,WORKRET
         MVC   VMCFPL(40),SLOT3
         XC    VMCFPL(2),VMCFPL
         MVC   VMCFPL+2(2),=X'000B'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         L     14,WORKRET
         BR    14
*
* Error paths stack compact diagnostics.  Return code is 8.
*
HNDERR   CMSSTACK TEXT=(EHND,L'EHND)
         B     FAIL
AUTHERR  CMSSTACK TEXT=(EAUTH,L'EAUTH)
         B     FAIL
BEGDIAG  CMSSTACK TEXT=(EBEGD,L'EBEGD)
         B     FAIL
BEGRET   CMSSTACK TEXT=(EBEGR,L'EBEGR)
         B     FAIL
QDIAG    CMSSTACK TEXT=(EQDIA,L'EQDIA)
         B     FAIL
QPRE     CMSSTACK TEXT=(EQPRE,L'EQPRE)
         B     FAIL
QBADNOTE CMSSTACK TEXT=(EQNOT,L'EQNOT)
         B     FAIL
QRESULT  CMSSTACK TEXT=(EQRES,L'EQRES)
FAIL     LA    15,8
         B     CLEAN
CLEANOK  SR    15,15
CLEAN    ST    15,SAVERC
         HNDEXT CLR,CODE=4001
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0001'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         L     15,SAVERC
         L     14,RETADDR
         BR    14
*
         DS    0D
VMCFPL   DS    XL40
VMCFBUF  DS    XL40
SLOT1    DS    XL40
SLOT2    DS    XL40
SLOT3    DS    XL40
QUERY    DS    CL58
VMCFECB  DC    F'0'
RETADDR  DS    F
WORKRET  DS    F
SAVERC   DS    F
MSTART   DC    C'M12A START'
MAUTH    DC    C'M12A VMCF AUTHORIZED'
MBEGS    DC    C'M12A BEGIN SENT'
MBEGR    DC    C'M12A BEGIN RESPONSE'
MQSENT   DC    C'M12A TLSQUERY SENT'
MQPRE    DC    C'M12A TLSQUERY PREPROCESS RESPONSE'
MQDONE   DC    C'M12A TLSQUERY COMPLETE'
PASSMSG  DC    C'M12A TLSQUERY SSL SERVICE AVAILABLE'
PASSLEN  EQU   *-PASSMSG
EHND     DC    C'M12A ERROR HNDEXT'
EAUTH    DC    C'M12A ERROR VMCF AUTHORIZE'
EBEGD    DC    C'M12A ERROR BEGIN DIAG'
EBEGR    DC    C'M12A ERROR BEGIN RETURN'
EQDIA    DC    C'M12A ERROR TLSQUERY DIAG'
EQPRE    DC    C'M12A ERROR TLSQUERY PREPROCESS'
EQNOT    DC    C'M12A ERROR TLSQUERY NOTIFICATION'
EQRES    DC    C'M12A TLSQUERY SSL SERVICE UNAVAILABLE'
         END   M12ATLS
