M12TLS2  CSECT
         USING M12TLS2,12
         LR    12,15
         ST    14,RETADDR
         WRTERM MCPU,L'MCPU
         WRTERM MSTART,L'MSTART
*
* M12A: z/VM Dynamic SSL TLSQuery capability probe.
* IBM z/VM 6.3 TCP/IP Programmer's Reference:
*   VMCF AUTHORIZE, BEGINtcpIPservice, TLSQuery CALLCODE 128.
* Blank TLS label asks whether the SSL server is available.
*
         HNDEXT SET,'DUMMY',CODE=4001,ECB=(VMCFECB,OS),ERROR=HNDERR
         LTR   15,15
         BNZ   HNDERR
         ENABLE INTTYPE=ALL
         STCTL 0,0,OLDCR0
         MVC   SAVECR0(4),OLDCR0
         OI    SAVECR0+3,X'01'
         LCTL  0,0,SAVECR0
         WRTERM MENAB,L'MENAB
*
* Authorize VMCF with a 40-byte external interrupt buffer.
*
         XC    VMCFBUF(40),VMCFBUF
         XC    VMCFPL(40),VMCFPL
         MVI   VMCFPL,X'80'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         LA    2,VMCFBUF
         ST    2,VMCFPL+16
         LA    2,40
         ST    2,VMCFPL+20
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   AUTHERR
         WRTERM MAUTH,L'MAUTH
*
* BEGINtcpIPservice: SEND, CALLCODE 101, TCPIP, client level 6.3.0.
*
         BAL   14,CLEARECB
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0002'
         MVC   VMCFPL+4(4),=X'00000002'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         MVC   VMCFPL+20(4),=X'00000001'
         MVC   VMCFPL+32(4),=X'06300000'
         MVC   VMCFPL+36(2),=X'0000'
         MVI   VMCFPL+38,X'65'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   BEGDIAG
         WRTERM MBEGS,L'MBEGS
         BAL   14,WAITEVT
         LTR   15,15
         BNZ   BEGTO
         MVC   SLOT1(40),VMCFBUF
         WRTERM MBEGR,L'MBEGR
         CLI   SLOT1+39,X'00'
         BNE   BEGRET
*
* IBM requires HANDLEnotice after BEGINtcpIPservice and before using
* TCP/IP services.  No ordinary notification classes are needed by
* this TLSQuery probe, so use a zero notification mask.
*
         BAL   14,CLEARECB
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0002'
         MVC   VMCFPL+4(4),=X'00000002'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         MVC   VMCFPL+20(4),=X'00000001'
         MVI   VMCFPL+38,X'69'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   HNDDIAG
         WRTERM MHNDS,L'MHNDS
         BAL   14,WAITEVT
         LTR   15,15
         BNZ   HNDTO
         MVC   SLOTH(40),VMCFBUF
         WRTERM MHNDR,L'MHNDR
         CLI   SLOTH+39,X'00'
         BNE   HNDRET
*
* TLSQuery: SEND/RECV, CALLCODE 128. Query record is 8 blank
* label bytes plus 50 blank keyring bytes, as documented for VM.
* IBM requires CIBB=UNSPECIFIEDconnection (-48, X'FFD0').
*
         BAL   14,CLEARECB
         MVC   QUERY(58),=CL58' '
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0003'
         MVC   VMCFPL+4(4),=X'00000004'
         MVC   VMCFPL+8(8),=CL8'TCPIP'
         LA    3,QUERY
         ST    3,VMCFPL+16
         LA    3,58
         ST    3,VMCFPL+20
         MVC   VMCFPL+36(2),=X'FFD0'
         MVI   VMCFPL+38,X'80'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         LTR   2,2
         BNZ   QDIAG
         WRTERM MQSENT,L'MQSENT
         BAL   14,WAITEVT
         LTR   15,15
         BNZ   QPRETO
         MVC   SLOT2(40),VMCFBUF
         WRTERM MQPRE,L'MQPRE
         LA    2,SLOT2
         BAL   14,DUMP40
         TM    SLOT2,X'80'
         BNO   QBADHDR
         CLI   SLOT2+1,X'00'
         BNE   QVMCF
         CLC   SLOT2+2(2),=X'0003'
         BNE   QBADHDR
         CLC   SLOT2+4(4),=X'00000004'
         BNE   QBADHDR
         CLI   SLOT2+38,X'80'
         BNE   QBADHDR
*
* Slot 2 is the preprocessing response.  Slot 3 is the
* QUERYtlsCOMPLETE notification (z/VM 6.3 CALLCODE X'21', decimal 33).
*
         CLI   SLOT2+39,X'00'
         BNE   QPRE
         XC    VMCFECB,VMCFECB
         BAL   14,WAITNXT
         LTR   15,15
         BNZ   QDONETO
         MVC   SLOT3(40),VMCFBUF
         WRTERM MQDONE,L'MQDONE
         CLI   SLOT3+38,X'21'
         BNE   QBADNOTE
         BAL   14,REJNOTE
         CLI   SLOT3+39,X'00'
         BNE   QRESULT
         WRTERM PASSMSG,PASSLEN
         B     CLEANOK
*
CLEARECB XC    VMCFECB,VMCFECB
         XC    VMCFBUF(40),VMCFBUF
         BR    14
*
* Bounded wait for a VMCF event.  Return R15=0 when either the
* ECB is posted or the interrupt buffer changes; R15=8 on timeout.
*
WAITEVT  ST    14,WAITRET
         STCK  STARTTOD
WAITLP   CLC   VMCFECB(4),=F'0'
         BNE   WAITOK
         CLC   VMCFBUF(40),ZERO40
         BNE   WAITOK
         STCK  NOWTOD
         L     5,NOWTOD
         S     5,STARTTOD
         C     5,=F'5'
         BL    WAITLP
         LA    15,8
         L     14,WAITRET
         BR    14
WAITOK   SR    15,15
         L     14,WAITRET
         BR    14
*
* Preserve VMCFBUF after preprocess.  Completion may already have
* replaced it before this wait begins.
*
WAITNXT  ST    14,WAITRET
         STCK  STARTTOD
WAITNLP  CLC   VMCFBUF(40),SLOT2
         BNE   WAITOK
         STCK  NOWTOD
         L     5,NOWTOD
         S     5,STARTTOD
         C     5,=F'30'
         BL    WAITNLP
         LA    15,8
         L     14,WAITRET
         BR    14
*
* A QUERYtlsCOMPLETE notification is a SEND.  IBM requires
* completion with VMCF REJECT using the interrupt header data.
*
REJNOTE  ST    14,WORKRET
         MVC   VMCFPL(40),SLOT3
         XC    VMCFPL(2),VMCFPL
         MVC   VMCFPL+2(2),=X'000B'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         L     14,WORKRET
         BR    14
*
* Render the 40-byte interrupt header as 80 hexadecimal characters.
*
DUMP40   ST    14,DUMPRET
         LA    3,HEXDUMP
         LA    4,40
DUMPLOOP SR    5,5
         IC    5,0(2)
         LR    6,5
         SRL   6,4
         N     6,=F'15'
         IC    7,HEXTAB(6)
         STC   7,0(3)
         N     5,=F'15'
         IC    7,HEXTAB(5)
         STC   7,1(3)
         LA    2,1(2)
         LA    3,2(3)
         BCT   4,DUMPLOOP
         WRTERM HEXDUMP,80
         L     14,DUMPRET
         BR    14
*
* Error paths print compact diagnostics.  Return code is 8.
*
HNDERR   WRTERM EHND,L'EHND
         B     FAIL
AUTHERR  WRTERM EAUTH,L'EAUTH
         B     FAIL
BEGDIAG  WRTERM EBEGD,L'EBEGD
         B     FAIL
BEGRET   WRTERM EBEGR,L'EBEGR
         B     FAIL
BEGTO    WRTERM EBEGTO,L'EBEGTO
         B     FAIL
HNDDIAG  WRTERM EHNDD,L'EHNDD
         B     FAIL
HNDTO    WRTERM EHNDTO,L'EHNDTO
         B     FAIL
HNDRET   WRTERM EHNDRET,L'EHNDRET
         B     FAIL
QDIAG    WRTERM EQDIA,L'EQDIA
         B     FAIL
QPRETO   WRTERM EQPTO,L'EQPTO
         B     FAIL
QDONETO  WRTERM EQDTO,L'EQDTO
         B     FAIL
QBADHDR  WRTERM EQHDR,L'EQHDR
         B     FAIL
QVMCF    SR    2,2
         IC    2,SLOT2+1
         TM    SLOT2+1,X'80'
         BZ    QVMCFP
         O     2,=X'FFFFFF00'
QVMCFP   ST    2,QPRERC
         CVD   2,QPREDEC
         MVC   QPRENUM(4),=X'40202020'
         ED    QPRENUM(4),QPREDEC+6
         WRTERM EQVMC,L'EQVMC
         WRTERM QPRENUM,L'QPRENUM
         B     FAIL
QPRE     SR    2,2
         IC    2,SLOT2+39
         TM    SLOT2+39,X'80'
         BZ    QPREP
         O     2,=X'FFFFFF00'
QPREP    ST    2,QPRERC
         CVD   2,QPREDEC
         MVC   QPRENUM(3),=X'402020'
         ED    QPRENUM(3),QPREDEC+6
         WRTERM EQPRE,L'EQPRE
         WRTERM QPRENUM,L'QPRENUM
         B     FAIL
QBADNOTE WRTERM EQNOT,L'EQNOT
         B     FAIL
QRESULT  WRTERM EQRES,L'EQRES
FAIL     LA    15,8
         B     CLEAN
CLEANOK  SR    15,15
CLEAN    ST    15,SAVERC
         LCTL  0,0,OLDCR0
         HNDEXT CLR,CODE=4001
         XC    VMCFPL(40),VMCFPL
         MVC   VMCFPL+2(2),=X'0001'
         LA    1,VMCFPL
         DC    X'83',X'12',XL2'0068'
         L     15,SAVERC
         L     14,RETADDR
         BR    14
*
         DS    0D
VMCFPL   DS    XL40
VMCFBUF  DS    XL40
SLOT1    DS    XL40
SLOTH    DS    XL40
SLOT2    DS    XL40
SLOT3    DS    XL40
ZERO40   DC    40X'00'
QUERY    DS    CL58
         DS    0D
STARTTOD DS    D
NOWTOD   DS    D
         DS    0F
VMCFECB  DC    F'0'
QPRERC   DS    F
         DS    0D
QPREDEC  DS    D
OLDCR0   DS    F
SAVECR0  DS    F
RETADDR  DS    F
WORKRET  DS    F
WAITRET  DS    F
DUMPRET  DS    F
SAVERC   DS    F
MCPU     DC    C'M12A BASE CPU SELECTED'
MENAB    DC    C'M12A INTERRUPTS ENABLED'
MSTART   DC    C'M12A START'
MAUTH    DC    C'M12A VMCF AUTHORIZED'
MBEGS    DC    C'M12A BEGIN SENT'
MBEGR    DC    C'M12A BEGIN RESPONSE'
MHNDS    DC    C'M12A HANDLE SENT'
MHNDR    DC    C'M12A HANDLE RESPONSE'
MQSENT   DC    C'M12A TLSQUERY SENT'
MQPRE    DC    C'M12A TLSQUERY PREPROCESS RESPONSE'
MQDONE   DC    C'M12A TLSQUERY COMPLETE'
PASSMSG  DC    C'M12A TLSQUERY SSL SERVICE AVAILABLE'
PASSLEN  EQU   *-PASSMSG
EHND     DC    C'M12A ERROR HNDEXT'
EAUTH    DC    C'M12A ERROR VMCF AUTHORIZE'
EBEGD    DC    C'M12A ERROR BEGIN DIAG'
EBEGR    DC    C'M12A ERROR BEGIN RETURN'
EBEGTO   DC    C'M12A ERROR BEGIN TIMEOUT'
EHNDD    DC    C'M12A ERROR HANDLE DIAG'
EHNDTO   DC    C'M12A ERROR HANDLE TIMEOUT'
EHNDRET  DC    C'M12A ERROR HANDLE RETURN'
EQDIA    DC    C'M12A ERROR TLSQUERY DIAG'
EQPTO    DC    C'M12A ERROR TLSQUERY PREPROCESS TIMEOUT'
EQDTO    DC    C'M12A ERROR TLSQUERY COMPLETE TIMEOUT'
EQHDR    DC    C'M12A ERROR TLSQUERY RESPONSE HEADER'
EQVMC    DC    C'M12A ERROR TLSQUERY VMCF RC'
EQPRE    DC    C'M12A ERROR TLSQUERY PREPROCESS RC'
QPRENUM  DC    CL4' '
HEXTAB   DC    C'0123456789ABCDEF'
HEXDUMP  DS    CL80
EQNOT    DC    C'M12A ERROR TLSQUERY NOTIFICATION'
EQRES    DC    C'M12A TLSQUERY SSL SERVICE UNAVAILABLE'
         END   M12TLS2
